hello-yan3/STM32-learning/10-ADC电压采集/3-ADC—双重ADC-单通道-交替采集/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2013-xx-xx
  * @brief   测试lcd
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火 F103-霸道 STM32 开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "main.h" 
#include "stm32f1xx.h"
#include "./usart/bsp_debug_usart.h"
#include <stdlib.h>
#include "./led/bsp_led.h" 
#include "./adc/bsp_adc.h"

/* 
多ADC实验
使用 ADC1 ADC2 同时采集一个通道
*/

float ADC_ConvertedValueLocal[2];
// AD转换结果值
uint32_t ADC_ConvertedValue;

/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{   
  HAL_Init();
  /* 配置系统时钟为72MHz */
  SystemClock_Config();

  /* 初始化USART1 配置模式为 115200 8-N-1 */
  DEBUG_USART_Config();

  ADCx_Init();
	// 执行 ADC 自动自校准，注意必须在ADC启动前使用
  HAL_ADCEx_Calibration_Start(&hadcx1);  
  HAL_ADCEx_Calibration_Start(&hadcx2);
  
  /* 启动AD转换并使能DMA传输和中断 */
	/* 注意必须先启动DMA2，在多重启动DMA1 */
  HAL_ADC_Start(&hadcx2);
	// 参数分别为：句柄结构体，数据存放地址，数据长度(多通道的通道数)
  HAL_ADCEx_MultiModeStart_DMA(&hadcx1, &ADC_ConvertedValue, 1);
  
  /* 无限循环 */
  while (1)
  {
    HAL_Delay(1000);
    /* 3.3为AD转换的参考电压值，stm32的AD转换为12bit，2^12=4096，
       即当输入为3.3V时，AD转换结果为4096 */
		// 双ADC采集，ADC2采集到数据保存在ADC1的高16位，因此DMA配置数据32位，
		// 采集结果搬运到1个32位变量中，数据会依次保存在低16位，高16位
    ADC_ConvertedValueLocal[0] = (float)(ADC_ConvertedValue&0xFFF)*3.3/4096; 
	  ADC_ConvertedValueLocal[1] = (float)((ADC_ConvertedValue>>16)&0xFFF)*3.3/4096; 
    
		printf("ADC1转换原始值 = 0x%04X --> 电压值 = %f V \n", ADC_ConvertedValue&0xFFFF, ADC_ConvertedValueLocal[0]);    
    printf("ADC2转换原始值 = 0x%04X --> 电压值 = %f V \n", (ADC_ConvertedValue>>16)&0xFFFF, ADC_ConvertedValueLocal[1]);      
    
    printf("\r\n");    
  }
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 72000000
  *            HCLK(Hz)                       = 72000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 2
  *            APB2 Prescaler                 = 1
  *            HSE Frequency(Hz)              = 8000000
  *            HSE PREDIV1                    = 2
  *            PLLMUL                         = 9
  *            Flash Latency(WS)              = 0
  * @param  None
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef clkinitstruct = {0};
  RCC_OscInitTypeDef oscinitstruct = {0};
  
  /* Enable HSE Oscillator and activate PLL with HSE as source */
  oscinitstruct.OscillatorType  = RCC_OSCILLATORTYPE_HSE;
  oscinitstruct.HSEState        = RCC_HSE_ON;
  oscinitstruct.HSEPredivValue  = RCC_HSE_PREDIV_DIV1;
  oscinitstruct.PLL.PLLState    = RCC_PLL_ON;
  oscinitstruct.PLL.PLLSource   = RCC_PLLSOURCE_HSE;
  oscinitstruct.PLL.PLLMUL      = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&oscinitstruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  clkinitstruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  clkinitstruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  clkinitstruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  clkinitstruct.APB2CLKDivider = RCC_HCLK_DIV1;
  clkinitstruct.APB1CLKDivider = RCC_HCLK_DIV2;  
  if (HAL_RCC_ClockConfig(&clkinitstruct, FLASH_LATENCY_2)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
